Repository: hfukuchi/Linux_Kernel_Release_Model
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: This post is based on a whitepaper I wrote at the beginning of 2016 to be used to help many different companies understand the Linux kernel release model and encourage them to start taking the LTS stable updates more often.
ja: この投稿は、2016年初めに書いたホワイトペーパーを基にしています。このホワイトペーパーは、多くの企業がLinux Kernelリリース モデルを理解してLTSの更新をもっと頻繁に採用することを奨励するために書かれたものです。

source: This prevents many problems that other projects who maintain a stable and development branch can have.
ja: これは、Stableと開発のブランチを保守している他のプロジェクトで生じうる多くの問題を防止します。

source: This process seems to have worked out well, without many problems being reported against the 4.9.y tree, despite it containing over 16,000 changes, making it the largest kernel to ever be released.
ja: この選定プロセスは、うまく機能しているように見えます。4.9.yツリーは、過去にリリースされた中で最大のKernelですが、16000箇所の変更を施したにも関わらず、問題は多くは報告されていません。

source: This promise holds true for both the incremental stable kernel updates, as well as the larger “major” updates that happen every three months.
ja: この約束は、3か月ごとに実行される「メジャー」アップデートと同様に、インクリメンタルに出されるStable Kernelアップデートでも順守されます。

source: This sequence is usually shortened with the number “4.9.y” when referring to a stable kernel release tree.
ja: Stable Kernelツリーを参照する場合、この系列は、普通“4.9.y”と短く表現されます。

source: This should allow SoC vendors to plan ahead on their development cycle to not release new chipsets based on older, and soon to be obsolete, LTS kernel versions.
ja: このプロセスによれば、SoCベンダーも、新しいチップセットに古くて保守されなくなるLTS Kernelバージョンを採用しないように事前に開発サイクルを計画できます。

source: This was agreed upon at the annual Linux kernel summit and started with the 4.1.y LTS choice.
ja: このことは、年次のLinux Kernel Summitで賛同され、LTS 4.1.yの選定から開始されました。

source: This was done because the higher numbers were starting to cause confusion among users, and because Greg Kroah-Hartman, the stable kernel maintainer, was getting tired of the large numbers and bribed Linus with a fine bottle of Japanese whisky.
ja: このことが起きたのは、大きなバージョン番号がユーザーに混乱をもたらし始めていたこと、Stable Kernelメンテナーのグレッグ クロー ハートマン（Greg Kroah-Hartman）が大きな数字に飽きあきしてリーナスを焼酎の銘酒で買収したこと、に起因します。

source: This was done on purpose as previously, when companies and kernel developers knew ahead of time what the next LTS kernel was going to be, they relaxed their normal stringent review process and allowed lots of untested code to be merged (2.6.32.y).
ja: 前に書いた理由でこれは実施されましたが、企業や開発者が次のLTS Kernelになるものを事前に知っている時には、彼らは、通常は厳しいはずのレビュープロセスを緩和し、テストしていない多数のコードをマージしました。（2.6.32.y）

source: This, combined with the historical difficulty of pushing updates to embedded devices, results in almost all of them being stuck on a specific kernel release for the entire lifespan of the device.
ja: 組み込みデバイスへアップデートを導入することへの歴史的な困難も加わって、上記が原因となり、ほとんどすべてのデバイスはライフスパンで特定のKernelリリースにとどまり続けています。

source: Trying to keep individual kernels secure and with the latest bugfixes was a large and confusing effort by lots of different individuals.
ja: 個々のKernelを最新の不具合修正を取り込みながらセキュアに保つことは、多数の個人によって行われた混乱を伴う莫大な努力でした。

source: Umm.
ja: うーん

source: Users wanted bugfixes that were made during those 2-3 months, and the Linux distributions were getting tired of trying to keep their kernels up to date without any feedback from the kernel community.
ja: ユーザーは、この2，3か月の期間に不具合修正が実行されることを望んでいました。Linuxディストリビューションは、コミュニティからのフィードバックが無い中で彼らのKernelを最新に保つ作業に疲弊していました。

source: We disagree on
ja: 同意できないのは、

source: What part of "they are just normal bugs" did you have issues with?
ja: どの部分が「単なる通常の不具合」なのですか？

source: What was unclear about that?
ja: そのことは明白でしょう。

source: When doing kernel releases, the Linux kernel community almost never declares specific changes as “security fixes”.
ja: Kernerlリリースを行う際に、Linux Kernelコミュニティは、特定の変更を「セキュリティ修正（security fixes）」とは宣言することはほとんどありません。

source: When security problems are reported to the kernel community, they are fixed as soon as possible and pushed out publicly to the development tree and the stable releases.
ja: セキュリティ問題がKernelコミュニティに報告されると、それらは可能な限り早く修正されて、開発ツリーで公開された上で、Stableリリースされます。

source: Where these changes are found is described below.
ja: これらの変更がどこに加えられるかを以下で説明します。

source: With the release of the 2.6 kernel in December of 2003, the kernel developer community switched from the previous model of having a separate development and stable kernel branch, and moved to a “stable only” branch model.
ja: 2003年12月のKernel 2.6のリリースから、Kernelコミュニティは、個別の開発ブランチとStableブランチを持つモデルから、Stableブランチだけのモデルへ切り替えました。

source: With the recent craziness of Meltdown and Spectre , I’ve seen lots of things written about how Linux is released and how we handle handles security patches that are totally incorrect, so I figured it is time to dust off the text, update it in a few places, and publish this here for everyone to benefit from.
ja: 最近起きたMeltdownとSpectreに関する大騒ぎの最中に、Linuxのリリース方法やセキュリティ パッチの管理について書かれた多くのものを見ましたが、全く間違っていました。それで、潮時が来たことを知り、ホワイトペーパーのほこりを払い、数か所だけ書き換え、皆さんのためになるようにここに公開することにしたのです。

source: Without their help, this post would be a total mess.
ja: レビュワーの手助けなしには、この投稿は完全にめちゃくちゃな文章になっていたことでしょう。

source: You have two cases:
ja: あなたに従えば、2つのケースが考えられます：

source: You think that explicitly pointing something out as a security issue is
ja: セキュリティ問題を明白に指し示すことこそが本当に重要だと考えているから、

source: all the people at universities rushing in to test it).
ja: 好まないからです。）

source: aren't potential security fixes.
ja: セキュリティが修正される可能性を考えさせないからです。

source: because I don't want to perpetuate the myth of "security fixes" as a
ja: というのも、「セキュリティ修正」は「単なる普通の不具合修正」とは別物であるという神話を

source: because bugs are bugs.
ja: 不具合は不具合でしかないです。

source: can be a new device id or quirk for hardware, but not add major new functionality
ja: ハードウェアの新しいDevice IDや癖である。ただし、新しいメジャーな機能追加ではないこと。

source: counter-productive.
ja: 考えています。

source: explained, it shouldn't be spread around unnecessarily.
ja: 一度説明してしまえば、それは不必要に広めるべきではありません。

source: information for the developers to explain why a patch is needed, but once
ja: 何故パッチが必要なのかを説明するためには重要な情報です。しかし、

source: kernel list a patch for a fix, and then in the very next email send (in
ja: その直後のメールで問題の悪用例をセキュリティ メーリング リストに（プライベートに）

source: matter.
ja: 問題なのです。

source: must already be merged into Linus’s tree
ja: リーナス ツリーに既にマージされていなくてはならない。

source: must be obviously correct and tested.
ja: 明らかに正しく、かつテストされていなければならない。

source: must fix only one thing.
ja: 1つのことだけ修正しなくてはならない。

source: must fix something that has been reported to be an issue.
ja: 問題として報告されたものを修正しなくてはならない。

source: must not be bigger than 100 lines.
ja: 100行より大きくてはいけない。

source: private for a reason, even if it's real information.
ja: それがプライベートなわけです。たとえ、それが重要な情報であってもです。

source: private) an example exploit of the problem to the security mailing list
ja: 送ってくれるというものです。

source: really important, so you think it's always "relevant".
ja: それがいつも「関連する」と考えるわけです。

source: separate thing from "plain regular bug fixes".
ja: 不朽のものにしたくないからです。

source: should work.
ja: ことが動くべき方法です。

source: that single word: "relevant".
ja: 「関連する」という一単語です。

source: the bug down, but once it is fixed, it becomes irrelevant.
ja: しかし、一度修正してしまえば、それは関連しなくなります。

source: the opposite view.
ja: 逆の見方をします。

source: tigger a bug.
ja: 思えません。

source: unmarked bugfixes are "less important".
ja: マークされていないものは「あまり重要でない」と考える。
